Revit 2027 API
BoundaryConditions.IsValidHostId Method
 Checks if the provided host id can host a boundary conditions of the provided type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidHostId(
	Document doc,
	ElementId hostId,
	BoundaryConditionsType type
)
Public Shared Function IsValidHostId (
	doc As Document,
	hostId As ElementId,
	type As BoundaryConditionsType
) As Boolean
public:
static bool IsValidHostId(
	Document^ doc,
	ElementId^ hostId,
	BoundaryConditionsType type
)
static member IsValidHostId :
        doc : Document *
        hostId : ElementId *
        type : BoundaryConditionsType -> bool
Parameters
doc Document
 The document containing both the host and the boundary conditions.
hostId ElementId
 The id of the analytical element that is about to host a boundary conditions.
type BoundaryConditionsType
 The type of the boundary conditions that is about to be hosted.
Return Value
Boolean
 True if an area boundary conditions can be placed on the input host id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace